export const eventsData = [
    {
        id: 1,
        taskLabel: "Создать страницу Events",
        taskText: "Создать страницу Events для отображения списка событий.",
        isComplete: false
    },
    {
        id: 2,
        taskLabel: "Добавить маршрут для страницы Events",
        taskText: "Добавить маршрут в вашем приложении для доступа к странице Events.",
        isComplete: false
    },
    {
        id: 3,
        taskLabel: "Загрузить список ивентов",
        taskText: "Написать логику для загрузки списка событий из базы данных или другого источника данных.",
        isComplete: false
    },
    {
        id: 4,
        taskLabel: "Отобразить список событий",
        taskText: "Используя полученные данные, отобразить список событий на странице Events.",
        isComplete: false
    },
    {
        id: 5,
        taskLabel: "Создать динамические страницы для событий",
        taskText: "Реализовать динамические страницы для каждого события, используя [eventId].tsx.",
        isComplete: false
    },
    {
        id: 6,
        taskLabel: "Добавить маршрут для динамических страниц",
        taskText: "Добавить маршрут в вашем приложении для доступа к динамическим страницам событий.",
        isComplete: false
    },
    {
        id: 7,
        taskLabel: "Реализовать страницу EventDetails",
        taskText: "Создать страницу EventDetails для отображения подробной информации о каждом событии.",
        isComplete: false
    },
    {
        id: 8,
        taskLabel: "Добавить переход на EventDetails",
        taskText: "Добавить функциональность перехода на страницу EventDetails при клике на один из элементов списка событий.",
        isComplete: false
    },
    {
        id: 9,
        taskLabel: "Создать вложенные маршруты для фотографий",
        taskText: "Добавить вложенные маршруты для отображения фотографий события, используя [eventId]/photos/[photoId].tsx.",
        isComplete: false
    },
    {
        id: 10,
        taskLabel: "Обработать ошибку 404",
        taskText: "Создать страницу 404 для обработки случаев, когда страница не найдена, и добавить логику перенаправления на главную страницу после некоторого времени.",
        isComplete: false
    },
    {
        id: 11,
        taskLabel: "Программная навигация",
        taskText: "Использовать функцию router.push() для программного перехода между страницами в вашем приложении.",
        isComplete: false
    },
    {
        id: 12,
        taskLabel: "Исследовать множественные параметры",
        taskText: "Исследовать возможности множественных параметров с помощью [...params].tsx.",
        isComplete: false
    },
    {
        id: 1,
        taskLabel: "Создать страницу Events",
        taskText: "Создать страницу Events для отображения списка событий.",
        isComplete: false
    },
    {
        id: 2,
        taskLabel: "Добавить маршрут для страницы Events",
        taskText: "Добавить маршрут в вашем приложении для доступа к странице Events.",
        isComplete: false
    },
    {
        id: 3,
        taskLabel: "Загрузить список ивентов",
        taskText: "Написать логику для загрузки списка событий из базы данных или другого источника данных.",
        isComplete: false
    },
    {
        id: 4,
        taskLabel: "Отобразить список событий",
        taskText: "Используя полученные данные, отобразить список событий на странице Events.",
        isComplete: false
    },
    {
        id: 5,
        taskLabel: "Создать динамические страницы для событий",
        taskText: "Реализовать динамические страницы для каждого события, используя [eventId].tsx.",
        isComplete: false
    },
    {
        id: 6,
        taskLabel: "Добавить маршрут для динамических страниц",
        taskText: "Добавить маршрут в вашем приложении для доступа к динамическим страницам событий.",
        isComplete: false
    },
    {
        id: 7,
        taskLabel: "Реализовать страницу EventDetails",
        taskText: "Создать страницу EventDetails для отображения подробной информации о каждом событии.",
        isComplete: false
    },
    {
        id: 8,
        taskLabel: "Добавить переход на EventDetails",
        taskText: "Добавить функциональность перехода на страницу EventDetails при клике на один из элементов списка событий.",
        isComplete: false
    },
    {
        id: 9,
        taskLabel: "Создать вложенные маршруты для фотографий",
        taskText: "Добавить вложенные маршруты для отображения фотографий события, используя [eventId]/photos/[photoId].tsx.",
        isComplete: false
    },
    {
        id: 10,
        taskLabel: "Обработать ошибку 404",
        taskText: "Создать страницу 404 для обработки случаев, когда страница не найдена, и добавить логику перенаправления на главную страницу после некоторого времени.",
        isComplete: false
    },
    {
        id: 11,
        taskLabel: "Программная навигация",
        taskText: "Использовать функцию router.push() для программного перехода между страницами в вашем приложении.",
        isComplete: false
    },
    {
        id: 12,
        taskLabel: "Исследовать множественные параметры",
        taskText: "Исследовать возможности множественных параметров с помощью [...params].tsx.",
        isComplete: false
    }
];
